<?php 
/**
 * mr random sentences
 * Plugin Name: mr random sentences
 * Description:plugin for create mr random sentences
 * Author: Mahdi Rezaei
 */

defined('ABSPATH') || exit;
define ('MR_RANDOM_SENTENCES_VIEW',plugin_dir_path( __FILE__ ) . 'view/');

function mr_random_sentenses_style(){
    include(MR_RANDOM_SENTENCES_VIEW . 'style.php');

}
add_action( 'wp_head', 'mr_random_sentenses_style');

function mr_random_sentenses_body(){
    $sentences = [
        [
            'content'   => 'خداوند همه چیز را در یک روز نیافرید. پس چه چیز باعث شد که من بیندیشم می‌توانم همه چیز را در یک روز به دست بیاورم؟ ',
            'path'      => 'چارلی چاپلین ',
        ],
        [
            'content'   => 'به محض اینکه کاری در جهت منافع کسی انجام می‌دهید، نه تنها او به شما فکر می‌کند بلکه خداوند نیز به شما فکر می‌کند. ',
            'path'      => 'پاراما هانسا یوگاناندا',
        ],
        [
            'content'   => 'یک دروغ ممکن است دنیا را دور بزند و به جای اولش برگردد؛ اما در همین مدت، یک حقیقت هنوز دارد بند کفش‌های خود را می‌بندد تا حرکت کند. ',
            'path'      => 'مارک تواین',
        ],
        [
            'content'   => 'بى‏همسران خود و غلامان و كنيزان درستكارتان را همسر دهيد اگر تنگدستند خداوند آنان را از فضل خويش بى‏نياز خواهد كرد و خدا گشايشگر داناست ',
            'path'      => '(نور 32)',
        ],
        [
            'content'   => 'برای اجتناب از بحران می توانید از سیاست سکوت استفاده کنید. ',
            'path'      => '(سوزان کوئیلیام)',
        ],
        [
            'content'   => 'درباره شراب و قمار از تو مى‏پرسند بگو در آن دوگناهى بزرك و سودهايى براى مردم است و[لى] گناهشان از سودشان بزرگتر است و از تو مى‏پرسند چه چيزى انفاق كنند بگو مازاد [بر نيازمندى خود] را اين گونه خداوند آيات [خود را] براى شما روشن مى‏گرداند باشد كه بينديشيد ',
            'path'      => '(بقره 219)',
        ],
        [
            'content'   => 'اى كسانى كه ايمان آورده‏ايد از بسيارى از گمانها بپرهيزيد كه پاره‏اى از گمانها گناه است و جاسوسى مكنيد و بعضى از شما غيبت بعضى نكند آيا كسى از شما دوست دارد كه گوشت برادر مرده‏اش را بخورد از آن كراهت داريد [پس] از خدا بترسيد كه خدا توبه‏پذير مهربان است ',
            'path'      => '(حجرات 12)',
        ],
        [
            'content'   => 'بگو اى بندگان من كه بر خويشتن زياده‏روى روا داشته‏ايد از رحمت‏خدا نوميد مشويد در حقيقت‏خدا همه گناهان را مى‏آمرزد كه او خود آمرزنده مهربان است ',
            'path'      => '(زمر 53)',
        ],
        [
            'content'   => 'پس هر كه هموزن ذره‏اى نيكى كند [نتيجه] آن را خواهد ديد و هر كه هموزن ذره‏اى بدى كند [نتيجه] آن را خواهد ديد',
            'path'      => '(7و8 زلزال)',
        ],
        [
            'content'   => 'پس [بدان كه] با دشوارى آسانى است آرى با دشوارى آسانى است ',
            'path'      => '(5و6 انشراح)',
        ],
    ];
    $sentence = $sentences[rand(0,count($sentences)-1)];
    $path     = $sentence['path'];
    $content  = $sentence['content'];

    include(MR_RANDOM_SENTENCES_VIEW . 'body.php');

}
add_action( 'wp_footer', 'mr_random_sentenses_body');
